
var city = [
  {
    title:"热门城市",
    type:'hot',
    item: [
      {
        "name": "兰州市",
        "key": "热门"
      },
      {
        "name": "秦安县",
        "key": "热门"
      },
      {
        "name": "庄浪县",
        "key": "热门"
      }
    ]
  }, {
    title:"A",
    item: [
      {
		"name": "阿克旗乡",
		"id": "A"
	  },
	  {
		"name": "阿克塞哈萨克族自治县",
		"id": "A"
	  },
	  {
		"name": "阿拉乡",
		"id": "A"
	  },
	  {
		"name": "阿勒腾乡",
		"id": "A"
	  },
	  {
		"name": "阿力麻土东乡族乡",
		"id": "A"
	  },
	  {
		"name": "阿木去乎镇",
		"id": "A"
	  },
	  {
		"name": "阿万仓镇",
		"id": "A"
	  },
	  {
		"name": "阿坞镇",
		"id": "A"
	  },
	  {
		"name": "阿夏乡",
		"id": "A"
	  },
	  {
		"name": "阿子滩乡",
		"id": "A"
	  },
	  {
		"name": "安定区",
		"id": "A"
	  },
	  {
		"name": "安伏镇",
		"id": "A"
	  },
	  {
		"name": "安国镇",
		"id": "A"
	  },
	  {
		"name": "安化镇",
		"id": "A"
	  },
	  {
		"name": "安集乡",
		"id": "A"
	  },
	  {
		"name": "安家坡乡",
		"id": "A"
	  },
	  {
		"name": "安口镇",
		"id": "A"
	  },
	  {
		"name": "安宁区",
		"id": "A"
	  },
	  {
		"name": "安阳乡",
		"id": "A"
	  },
	  {
		"name": "安远镇",
		"id": "A"
	  },
	  {
		"name": "岸门口镇",
		"id": "A"
	  }
    ]
  }, {
    title: "B",
    item: [
      {
		"name": "八丹乡",
		"id": "B"
	  },
	  {
		"name": "八角镇",
		"id": "B"
	  },
	  {
		"name": "八楞乡",
		"id": "B"
	  },
	  {
		"name": "八里铺镇",
		"id": "B"
	  },
	  {
		"name": "八里湾乡",
		"id": "B"
	  },
	  {
		"name": "八里湾镇",
		"id": "B"
	  },
	  {
		"name": "八里镇",
		"id": "B"
	  },
	  {
		"name": "八力镇",
		"id": "B"
	  },
	  {
		"name": "八松乡",
		"id": "B"
	  },
	  {
		"name": "八珠乡",
		"id": "B"
	  },
	  {
		"name": "巴藏乡",
		"id": "B"
	  },
	  {
		"name": "白草塬镇",
		"id": "B"
	  },
	  {
		"name": "白关乡",
		"id": "B"
	  },
	  {
		"name": "白河镇",
		"id": "B"
	  },
	  {
		"name": "白家湾乡",
		"id": "B"
	  },
	  {
		"name": "白碌乡",
		"id": "B"
	  },
	  {
		"name": "白马铺镇",
		"id": "B"
	  },
	  {
		"name": "白马乡",
		"id": "B"
	  },
	  {
		"name": "白庙乡",
		"id": "B"
	  },
	  {
		"name": "白沙镇",
		"id": "B"
	  },
	  {
		"name": "白水镇",
		"id": "B"
	  },
	  {
		"name": "白驼镇",
		"id": "B"
	  },
	  {
		"name": "白王乡",
		"id": "B"
	  },
	  {
		"name": "白杨乡",
		"id": "B"
	  },
	  {
		"name": "白银蒙古族乡",
		"id": "B"
	  },
	  {
		"name": "白银区",
		"id": "B"
	  },
	  {
		"name": "白银市",
		"id": "B"
	  },
	  {
		"name": "百和乡",
		"id": "B"
	  },
	  {
		"name": "百里镇",
		"id": "B"
	  },
	  {
		"name": "柏林镇",
		"id": "B"
	  },
	  {
		"name": "柏树乡",
		"id": "B"
	  },
	  {
		"name": "柏树镇",
		"id": "B"
	  },
	  {
		"name": "板桥镇",
		"id": "B"
	  },
	  {
		"name": "榜罗镇",
		"id": "B"
	  },
	  {
		"name": "宝积镇",
		"id": "B"
	  },
	  {
		"name": "堡子坝镇",
		"id": "B"
	  },
	  {
		"name": "北城铺镇",
		"id": "B"
	  },
	  {
		"name": "北街办事处",
		"id": "B"
	  },
	  {
		"name": "北岭乡",
		"id": "B"
	  },
	  {
		"name": "北滩镇",
		"id": "B"
	  },
	  {
		"name": "北湾镇",
		"id": "B"
	  },
	  {
		"name": "北塬镇",
		"id": "B"
	  },
	  {
		"name": "北寨镇",
		"id": "B"
	  },
	  {
		"name": "碧口镇",
		"id": "B"
	  },
	  {
		"name": "碧岩镇",
		"id": "B"
	  },
	  {
		"name": "碧玉镇",
		"id": "B"
	  },
	  {
		"name": "伯阳镇",
		"id": "B"
	  },
	  {
		"name": "博拉镇",
		"id": "B"
	  },
	  {
		"name": "博峪镇",
		"id": "B"
	  },
	  {
		"name": "卜家庄乡",
		"id": "B"
	  },
	  {
		"name": "布隆吉乡",
		"id": "B"
	  }
    ]
  }, {
    title: "C",
    item: [
      {
    "name": "采日玛乡",
    "id": "C"
  },
  {
    "name": "菜子镇",
    "id": "C"
  },
  {
    "name": "蔡家庙乡",
    "id": "C"
  },
  {
    "name": "蔡口集乡",
    "id": "C"
  },
  {
    "name": "蔡旗镇",
    "id": "C"
  },
  {
    "name": "藏巴哇镇",
    "id": "C"
  },
  {
    "name": "曹务镇",
    "id": "C"
  },
  {
    "name": "草川铺镇",
    "id": "C"
  },
  {
    "name": "草峰镇",
    "id": "C"
  },
  {
    "name": "草坪乡",
    "id": "C"
  },
  {
    "name": "草滩乡",
    "id": "C"
  },
  {
    "name": "草滩镇",
    "id": "C"
  },
  {
    "name": "草窝滩镇",
    "id": "C"
  },
  {
    "name": "策底镇",
    "id": "C"
  },
  {
    "name": "插岗乡",
    "id": "C"
  },
  {
    "name": "茶埠镇",
    "id": "C"
  },
  {
    "name": "柴家门镇",
    "id": "C"
  },
  {
    "name": "巉口镇",
    "id": "C"
  },
  {
    "name": "昌马乡",
    "id": "C"
  },
  {
    "name": "昌宁镇",
    "id": "C"
  },
  {
    "name": "常家河镇",
    "id": "C"
  },
  {
    "name": "朝那镇",
    "id": "C"
  },
  {
    "name": "车道乡",
    "id": "C"
  },
  {
    "name": "车家湾乡",
    "id": "C"
  },
  {
    "name": "车拉乡",
    "id": "C"
  },
  {
    "name": "陈户镇",
    "id": "C"
  },
  {
    "name": "陈家集镇",
    "id": "C"
  },
  {
    "name": "陈井镇",
    "id": "C"
  },
  {
    "name": "陈院镇",
    "id": "C"
  },
  {
    "name": "称钩驿镇",
    "id": "C"
  },
  {
    "name": "成县",
    "id": "C"
  },
  {
    "name": "城川镇",
    "id": "C"
  },
  {
    "name": "城壕镇",
    "id": "C"
  },
  {
    "name": "城郊镇",
    "id": "C"
  },
  {
    "name": "池坝乡",
    "id": "C"
  },
  {
    "name": "赤城乡",
    "id": "C"
  },
  {
    "name": "赤金镇",
    "id": "C"
  },
  {
    "name": "崇信县",
    "id": "C"
  },
  {
    "name": "初布乡",
    "id": "C"
  },
  {
    "name": "川城镇",
    "id": "C"
  },
  {
    "name": "川王镇",
    "id": "C"
  },
  {
    "name": "吹麻滩镇",
    "id": "C"
  },
  {
    "name": "春荣镇",
    "id": "C"
  },
  {
    "name": "春台乡",
    "id": "C"
  }
    ]
  }, {
    title: "D",
    item: [
		{
    "name": "达板镇",
    "id": "D"
  },
  {
    "name": "达川镇",
    "id": "D"
  },
  {
    "name": "达拉乡",
    "id": "D"
  },
  {
    "name": "达浪乡",
    "id": "D"
  },
  {
    "name": "达麦乡",
    "id": "D"
  },
  {
    "name": "打柴沟镇",
    "id": "D"
  },
  {
    "name": "大安乡",
    "id": "D"
  },
  {
    "name": "大坝镇",
    "id": "D"
  },
  {
    "name": "大堡镇",
    "id": "D"
  },
  {
    "name": "大草滩镇",
    "id": "D"
  },
  {
    "name": "大川镇",
    "id": "D"
  },
  {
    "name": "大沟镇",
    "id": "D"
  },
  {
    "name": "大河店镇",
    "id": "D"
  },
  {
    "name": "大河家镇",
    "id": "D"
  },
  {
    "name": "大河乡",
    "id": "D"
  },
  {
    "name": "大红沟乡",
    "id": "D"
  },
  {
    "name": "大靖镇",
    "id": "D"
  },
  {
    "name": "大柳乡",
    "id": "D"
  },
  {
    "name": "大芦镇",
    "id": "D"
  },
  {
    "name": "大马营镇",
    "id": "D"
  },
  {
    "name": "大满镇",
    "id": "D"
  },
  {
    "name": "大门镇",
    "id": "D"
  },
  {
    "name": "大南峪镇",
    "id": "D"
  },
  {
    "name": "大桥镇",
    "id": "D"
  },
  {
    "name": "大秦乡",
    "id": "D"
  },
  {
    "name": "大石镇",
    "id": "D"
  },
  {
    "name": "大树乡",
    "id": "D"
  },
  {
    "name": "大滩镇",
    "id": "D"
  },
  {
    "name": "大同镇",
    "id": "D"
  },
  {
    "name": "大像山镇",
    "id": "D"
  },
  {
    "name": "大阳镇",
    "id": "D"
  },
  {
    "name": "大峪乡",
    "id": "D"
  },
  {
    "name": "大寨乡",
    "id": "D"
  },
  {
    "name": "大庄镇",
    "id": "D"
  },
  {
    "name": "大庄子乡",
    "id": "D"
  },
  {
    "name": "丹堡镇",
    "id": "D"
  },
  {
    "name": "旦马乡",
    "id": "D"
  },
  {
    "name": "党城湾镇",
    "id": "D"
  },
  {
    "name": "党川镇",
    "id": "D"
  },
  {
    "name": "党家岘乡",
    "id": "D"
  },
  {
    "name": "党原镇",
    "id": "D"
  },
  {
    "name": "党寨镇",
    "id": "D"
  },
  {
    "name": "宕昌县",
    "id": "D"
  },
  {
    "name": "刀告乡",
    "id": "D"
  },
  {
    "name": "德兴乡",
    "id": "D"
  },
  {
    "name": "邓马营湖生态建设指挥部",
    "id": "D"
  },
  {
    "name": "第三铺乡",
    "id": "D"
  },
  {
    "name": "电尕镇",
    "id": "D"
  },
  {
    "name": "店村镇",
    "id": "D"
  },
  {
    "name": "店子乡",
    "id": "D"
  },
  {
    "name": "刁祁镇",
    "id": "D"
  },
  {
    "name": "迭部县",
    "id": "D"
  },
  {
    "name": "丁家沟镇",
    "id": "D"
  },
  {
    "name": "鼎新镇",
    "id": "D"
  },
  {
    "name": "定宁镇",
    "id": "D"
  },
  {
    "name": "定西市",
    "id": "D"
  },
  {
    "name": "定远镇",
    "id": "D"
  },
  {
    "name": "东坝镇",
    "id": "D"
  },
  {
    "name": "东岔镇",
    "id": "D"
  },
  {
    "name": "东川镇",
    "id": "D"
  },
  {
    "name": "东大滩乡",
    "id": "D"
  },
  {
    "name": "东洞镇",
    "id": "D"
  },
  {
    "name": "东湖镇",
    "id": "D"
  },
  {
    "name": "东华镇",
    "id": "D"
  },
  {
    "name": "东江镇",
    "id": "D"
  },
  {
    "name": "东乐镇",
    "id": "D"
  },
  {
    "name": "东坪乡",
    "id": "D"
  },
  {
    "name": "东泉乡",
    "id": "D"
  },
  {
    "name": "东山镇",
    "id": "D"
  },
  {
    "name": "东升镇",
    "id": "D"
  },
  {
    "name": "东湾镇",
    "id": "D"
  },
  {
    "name": "东乡族自治县",
    "id": "D"
  },
  {
    "name": "东塬乡",
    "id": "D"
  },
  {
    "name": "东寨镇",
    "id": "D"
  },
  {
    "name": "董岭乡",
    "id": "D"
  },
  {
    "name": "董志镇",
    "id": "D"
  },
  {
    "name": "豆坝镇",
    "id": "D"
  },
  {
    "name": "独店镇",
    "id": "D"
  },
  {
    "name": "独山子东乡族乡",
    "id": "D"
  },
  {
    "name": "段家集乡",
    "id": "D"
  },
  {
    "name": "敦煌市",
    "id": "D"
  },
  {
    "name": "多儿乡",
    "id": "D"
  },
  {
    "name": "朵什镇",
    "id": "D"
  }
    ]
  }, {
    title: "E",
    item: [
      {
		"name": "二郎乡",
		"id": "e"
	  }
    ]
  }, {
    title: "F",
    item: [
      {
    "name": "发放镇",
    "id": "F"
  },
  {
    "name": "樊家川镇",
    "id": "F"
  },
  {
    "name": "范坝镇",
    "id": "F"
  },
  {
    "name": "方山乡",
    "id": "F"
  },
  {
    "name": "飞云镇",
    "id": "F"
  },
  {
    "name": "丰乐镇",
    "id": "F"
  },
  {
    "name": "丰台镇",
    "id": "F"
  },
  {
    "name": "丰望乡",
    "id": "F"
  },
  {
    "name": "风山乡",
    "id": "F"
  },
  {
    "name": "枫相乡",
    "id": "F"
  },
  {
    "name": "峰迭镇",
    "id": "F"
  },
  {
    "name": "凤翔镇",
    "id": "F"
  },
  {
    "name": "佛崖镇",
    "id": "F"
  },
  {
    "name": "伏家镇",
    "id": "F"
  },
  {
    "name": "枹罕镇",
    "id": "F"
  },
  {
    "name": "符家川镇",
    "id": "F"
  },
  {
    "name": "福星镇",
    "id": "F"
  },
  {
    "name": "附城镇",
    "id": "F"
  },
  {
    "name": "复兴乡",
    "id": "F"
  }
    ]
  }, {
    title: "G",
    item: [
      {
    "name": "尕海镇",
    "id": "G"
  },
  {
    "name": "甘草店镇",
    "id": "G"
  },
  {
    "name": "甘沟驿镇",
    "id": "G"
  },
  {
    "name": "甘沟镇",
    "id": "G"
  },
  {
    "name": "甘谷县",
    "id": "G"
  },
  {
    "name": "甘加镇",
    "id": "G"
  },
  {
    "name": "甘江头乡",
    "id": "G"
  },
  {
    "name": "甘浚镇",
    "id": "G"
  },
  {
    "name": "甘南藏族自治州",
    "id": "G"
  },
  {
    "name": "甘泉镇",
    "id": "G"
  },
  {
    "name": "甘州区",
    "id": "G"
  },
  {
    "name": "干城乡",
    "id": "G"
  },
  {
    "name": "皋兰县",
    "id": "G"
  },
  {
    "name": "高坝镇",
    "id": "G"
  },
  {
    "name": "高峰乡",
    "id": "G"
  },
  {
    "name": "高楼乡",
    "id": "G"
  },
  {
    "name": "高楼镇",
    "id": "G"
  },
  {
    "name": "高平镇",
    "id": "G"
  },
  {
    "name": "高桥镇",
    "id": "G"
  },
  {
    "name": "高山乡",
    "id": "G"
  },
  {
    "name": "高台县",
    "id": "G"
  },
  {
    "name": "高湾镇",
    "id": "G"
  },
  {
    "name": "高新区",
    "id": "G"
  },
  {
    "name": "高崖镇",
    "id": "G"
  },
  {
    "name": "葛家岔镇",
    "id": "G"
  },
  {
    "name": "耿湾乡",
    "id": "G"
  },
  {
    "name": "宫河镇",
    "id": "G"
  },
  {
    "name": "恭门镇",
    "id": "G"
  },
  {
    "name": "巩昌镇",
    "id": "G"
  },
  {
    "name": "拱坝乡",
    "id": "G"
  },
  {
    "name": "共和镇",
    "id": "G"
  },
  {
    "name": "贡井镇",
    "id": "G"
  },
  {
    "name": "古城乡",
    "id": "G"
  },
  {
    "name": "古城镇",
    "id": "G"
  },
  {
    "name": "古丰乡",
    "id": "G"
  },
  {
    "name": "古浪县",
    "id": "G"
  },
  {
    "name": "古浪镇",
    "id": "G"
  },
  {
    "name": "古坡镇",
    "id": "G"
  },
  {
    "name": "古战回族镇",
    "id": "G"
  },
  {
    "name": "固城乡",
    "id": "G"
  },
  {
    "name": "瓜州县",
    "id": "G"
  },
  {
    "name": "瓜州镇",
    "id": "G"
  },
  {
    "name": "关卜乡",
    "id": "G"
  },
  {
    "name": "关家川乡",
    "id": "G"
  },
  {
    "name": "关山乡",
    "id": "G"
  },
  {
    "name": "关子镇",
    "id": "G"
  },
  {
    "name": "官坊乡",
    "id": "G"
  },
  {
    "name": "官亭镇",
    "id": "G"
  },
  {
    "name": "广河县",
    "id": "G"
  },
  {
    "name": "广至藏族乡",
    "id": "G"
  },
  {
    "name": "贵清山镇",
    "id": "G"
  },
  {
    "name": "郭城驿镇",
    "id": "G"
  },
  {
    "name": "郭川镇",
    "id": "G"
  },
  {
    "name": "郭干乡",
    "id": "G"
  },
  {
    "name": "郭河乡",
    "id": "G"
  },
  {
    "name": "郭家堡镇",
    "id": "G"
  },
  {
    "name": "郭嘉镇",
    "id": "G"
  },
  {
    "name": "郭原乡",
    "id": "G"
  },
  {
    "name": "果耶乡",
    "id": "G"
  },
  {
    "name": "果园镇",
    "id": "G"
  }
    ]
  }, {

    title: "H",
    item: [
      {
    "name": "哈达铺镇",
    "id": "H"
  },
  {
    "name": "哈溪镇",
    "id": "H"
  },
  {
    "name": "哈岘乡",
    "id": "H"
  },
  {
    "name": "海石湾镇",
    "id": "H"
  },
  {
    "name": "海子滩镇",
    "id": "H"
  },
  {
    "name": "憨班乡",
    "id": "H"
  },
  {
    "name": "韩店镇",
    "id": "H"
  },
  {
    "name": "韩集镇",
    "id": "H"
  },
  {
    "name": "韩家集镇",
    "id": "H"
  },
  {
    "name": "韩院乡",
    "id": "H"
  },
  {
    "name": "韩佐乡",
    "id": "H"
  },
  {
    "name": "汉家岔镇",
    "id": "H"
  },
  {
    "name": "汉林镇",
    "id": "H"
  },
  {
    "name": "汉王镇",
    "id": "H"
  },
  {
    "name": "汉源镇",
    "id": "H"
  },
  {
    "name": "航天镇",
    "id": "H"
  },
  {
    "name": "蒿咀铺乡",
    "id": "H"
  },
  {
    "name": "蒿林乡",
    "id": "H"
  },
  {
    "name": "好梯乡",
    "id": "H"
  },
  {
    "name": "禾驮镇",
    "id": "H"
  },
  {
    "name": "合道镇",
    "id": "H"
  },
  {
    "name": "合黎镇",
    "id": "H"
  },
  {
    "name": "合水县",
    "id": "H"
  },
  {
    "name": "合作市",
    "id": "H"
  },
  {
    "name": "合作市苗圃",
    "id": "H"
  },
  {
    "name": "何坝镇",
    "id": "H"
  },
  {
    "name": "何家堡乡",
    "id": "H"
  },
  {
    "name": "何家畔镇",
    "id": "H"
  },
  {
    "name": "和平乡",
    "id": "H"
  },
  {
    "name": "和平镇",
    "id": "H"
  },
  {
    "name": "和盛镇",
    "id": "H"
  },
  {
    "name": "和政县",
    "id": "H"
  },
  {
    "name": "河东镇",
    "id": "H"
  },
  {
    "name": "河口镇",
    "id": "H"
  },
  {
    "name": "河畔镇",
    "id": "H"
  },
  {
    "name": "河桥镇",
    "id": "H"
  },
  {
    "name": "河滩镇",
    "id": "H"
  },
  {
    "name": "河西堡镇",
    "id": "H"
  },
  {
    "name": "河西乡",
    "id": "H"
  },
  {
    "name": "河西镇",
    "id": "H"
  },
  {
    "name": "黑泉镇",
    "id": "H"
  },
  {
    "name": "黑石镇",
    "id": "H"
  },
  {
    "name": "黑松驿镇",
    "id": "H"
  },
  {
    "name": "横梁乡",
    "id": "H"
  },
  {
    "name": "红堡镇",
    "id": "H"
  },
  {
    "name": "红城镇",
    "id": "H"
  },
  {
    "name": "红川镇",
    "id": "H"
  },
  {
    "name": "红古区",
    "id": "H"
  },
  {
    "name": "红古镇",
    "id": "H"
  },
  {
    "name": "红河乡",
    "id": "H"
  },
  {
    "name": "红河镇",
    "id": "H"
  },
  {
    "name": "红柳湾镇",
    "id": "H"
  },
  {
    "name": "红旗乡",
    "id": "H"
  },
  {
    "name": "红泉镇",
    "id": "H"
  },
  {
    "name": "红沙岗镇",
    "id": "H"
  },
  {
    "name": "红沙梁镇",
    "id": "H"
  },
  {
    "name": "红山窑镇",
    "id": "H"
  },
  {
    "name": "红水镇",
    "id": "H"
  },
  {
    "name": "红寺乡",
    "id": "H"
  },
  {
    "name": "红台乡",
    "id": "H"
  },
  {
    "name": "红湾寺镇",
    "id": "H"
  },
  {
    "name": "宏伟乡",
    "id": "H"
  },
  {
    "name": "洪德镇",
    "id": "H"
  },
  {
    "name": "洪水镇",
    "id": "H"
  },
  {
    "name": "洪祥镇",
    "id": "H"
  },
  {
    "name": "侯家川镇",
    "id": "H"
  },
  {
    "name": "后官寨镇",
    "id": "H"
  },
  {
    "name": "胡川镇",
    "id": "H"
  },
  {
    "name": "胡林家乡",
    "id": "H"
  },
  {
    "name": "虎洞镇",
    "id": "H"
  },
  {
    "name": "虎关乡",
    "id": "H"
  },
  {
    "name": "琥珀镇",
    "id": "H"
  },
  {
    "name": "花海镇",
    "id": "H"
  },
  {
    "name": "花牛镇",
    "id": "H"
  },
  {
    "name": "花所乡",
    "id": "H"
  },
  {
    "name": "花寨乡",
    "id": "H"
  },
  {
    "name": "花庄镇",
    "id": "H"
  },
  {
    "name": "华藏寺镇",
    "id": "H"
  },
  {
    "name": "华池县",
    "id": "H"
  },
  {
    "name": "华家岭镇",
    "id": "H"
  },
  {
    "name": "华歧镇",
    "id": "H"
  },
  {
    "name": "华亭县",
    "id": "H"
  },
  {
    "name": "铧尖镇",
    "id": "H"
  },
  {
    "name": "桦林镇",
    "id": "H"
  },
  {
    "name": "怀安乡",
    "id": "H"
  },
  {
    "name": "怀安镇",
    "id": "H"
  },
  {
    "name": "环城镇",
    "id": "H"
  },
  {
    "name": "环县",
    "id": "H"
  },
  {
    "name": "皇城镇",
    "id": "H"
  },
  {
    "name": "黄陈镇",
    "id": "H"
  },
  {
    "name": "黄花滩镇",
    "id": "H"
  },
  {
    "name": "黄花乡",
    "id": "H"
  },
  {
    "name": "黄门镇",
    "id": "H"
  },
  {
    "name": "黄泥堡乡",
    "id": "H"
  },
  {
    "name": "黄泥湾镇",
    "id": "H"
  },
  {
    "name": "黄坪乡",
    "id": "H"
  },
  {
    "name": "黄峤镇",
    "id": "H"
  },
  {
    "name": "黄渠镇",
    "id": "H"
  },
  {
    "name": "黄羊川镇",
    "id": "H"
  },
  {
    "name": "黄羊镇",
    "id": "H"
  },
  {
    "name": "黄峪乡",
    "id": "H"
  },
  {
    "name": "黄闸湾镇",
    "id": "H"
  },
  {
    "name": "黄寨镇",
    "id": "H"
  },
  {
    "name": "黄渚镇",
    "id": "H"
  },
  {
    "name": "徽县",
    "id": "H"
  },
  {
    "name": "会川镇",
    "id": "H"
  },
  {
    "name": "会宁县",
    "id": "H"
  },
  {
    "name": "会师镇",
    "id": "H"
  },
  {
    "name": "霍城镇",
    "id": "H"
  }
    ]
  }, {
    title: "J",
    item: [
	{
    "name": "鸡川镇",
    "id": "J"
  },
  {
    "name": "鸡峰镇",
    "id": "J"
  },
  {
    "name": "积石山保安族东乡族撒拉族自治县",
    "id": "J"
  },
  {
    "name": "吉仓乡",
    "id": "J"
  },
  {
    "name": "吉岘乡",
    "id": "J"
  },
  {
    "name": "藉口镇",
    "id": "J"
  },
  {
    "name": "嘉陵镇",
    "id": "J"
  },
  {
    "name": "嘉峪关市",
    "id": "J"
  },
  {
    "name": "夹河镇",
    "id": "J"
  },
  {
    "name": "贾川乡",
    "id": "J"
  },
  {
    "name": "贾河乡",
    "id": "J"
  },
  {
    "name": "尖山乡",
    "id": "J"
  },
  {
    "name": "碱滩镇",
    "id": "J"
  },
  {
    "name": "江口乡",
    "id": "J"
  },
  {
    "name": "江洛镇",
    "id": "J"
  },
  {
    "name": "江盘乡",
    "id": "J"
  },
  {
    "name": "将台乡",
    "id": "J"
  },
  {
    "name": "姜席镇",
    "id": "J"
  },
  {
    "name": "焦村镇",
    "id": "J"
  },
  {
    "name": "焦家庄镇",
    "id": "J"
  },
  {
    "name": "角弓镇",
    "id": "J"
  },
  {
    "name": "界石铺镇",
    "id": "J"
  },
  {
    "name": "金昌市",
    "id": "J"
  },
  {
    "name": "金川区",
    "id": "J"
  },
  {
    "name": "金村乡",
    "id": "J"
  },
  {
    "name": "金洞乡",
    "id": "J"
  },
  {
    "name": "金佛寺镇",
    "id": "J"
  },
  {
    "name": "金沟乡",
    "id": "J"
  },
  {
    "name": "金河镇",
    "id": "J"
  },
  {
    "name": "金集镇",
    "id": "J"
  },
  {
    "name": "金沙镇",
    "id": "J"
  },
  {
    "name": "金山乡",
    "id": "J"
  },
  {
    "name": "金山镇",
    "id": "J"
  },
  {
    "name": "金塔县",
    "id": "J"
  },
  {
    "name": "金塔乡",
    "id": "J"
  },
  {
    "name": "金塔镇",
    "id": "J"
  },
  {
    "name": "金崖镇",
    "id": "J"
  },
  {
    "name": "金羊镇",
    "id": "J"
  },
  {
    "name": "金钟镇",
    "id": "J"
  },
  {
    "name": "锦屏镇",
    "id": "J"
  },
  {
    "name": "泾川县",
    "id": "J"
  },
  {
    "name": "泾明乡",
    "id": "J"
  },
  {
    "name": "井沟乡",
    "id": "J"
  },
  {
    "name": "景古镇",
    "id": "J"
  },
  {
    "name": "景泰县",
    "id": "J"
  },
  {
    "name": "靖安乡",
    "id": "J"
  },
  {
    "name": "靖远县",
    "id": "J"
  },
  {
    "name": "静宁县",
    "id": "J"
  },
  {
    "name": "镜铁区",
    "id": "J"
  },
  {
    "name": "九墩滩指挥部",
    "id": "J"
  },
  {
    "name": "九墩乡",
    "id": "J"
  },
  {
    "name": "九合镇",
    "id": "J"
  },
  {
    "name": "九岘乡",
    "id": "J"
  },
  {
    "name": "酒泉经济技术开发区",
    "id": "J"
  },
  {
    "name": "酒泉市",
    "id": "J"
  },
  {
    "name": "居集镇",
    "id": "J"
  },
  {
    "name": "桔柑乡",
    "id": "J"
  },
  {
    "name": "咀头乡",
    "id": "J"
  }
    ]
  }, {
    title: "K",
    item: [
      {
    "name": "喀尔钦镇",
    "id": "K"
  },
  {
    "name": "卡坝乡",
    "id": "K"
  },
  {
    "name": "卡加道乡",
    "id": "K"
  },
  {
    "name": "卡加曼乡",
    "id": "K"
  },
  {
    "name": "开边镇",
    "id": "K"
  },
  {
    "name": "康多乡",
    "id": "K"
  },
  {
    "name": "康丰乡",
    "id": "K"
  },
  {
    "name": "康家集乡",
    "id": "K"
  },
  {
    "name": "康乐县",
    "id": "K"
  },
  {
    "name": "康乐镇",
    "id": "K"
  },
  {
    "name": "康宁乡",
    "id": "K"
  },
  {
    "name": "康县",
    "id": "K"
  },
  {
    "name": "考勒乡",
    "id": "K"
  },
  {
    "name": "柯寨镇",
    "id": "K"
  },
  {
    "name": "科才镇",
    "id": "K"
  },
  {
    "name": "崆峒区",
    "id": "K"
  },
  {
    "name": "崆峒镇",
    "id": "K"
  },
  {
    "name": "口头坝乡",
    "id": "K"
  },
  {
    "name": "苦水镇",
    "id": "K"
  },
  {
    "name": "宽川镇",
    "id": "K"
  }
    ]
  }, {

    title: "L",
    item:[
      {
    "name": "拉卜楞镇",
    "id": "L"
  },
  {
    "name": "拉仁关乡",
    "id": "L"
  },
  {
    "name": "腊子口镇",
    "id": "L"
  },
  {
    "name": "来紫堡乡",
    "id": "L"
  },
  {
    "name": "兰州市",
    "id": "L"
  },
  {
    "name": "兰州新区",
    "id": "L"
  },
  {
    "name": "郎木寺镇",
    "id": "L"
  },
  {
    "name": "老城镇",
    "id": "L"
  },
  {
    "name": "老军乡",
    "id": "L"
  },
  {
    "name": "老君庙镇",
    "id": "L"
  },
  {
    "name": "老君坡镇",
    "id": "L"
  },
  {
    "name": "勒秀镇",
    "id": "L"
  },
  {
    "name": "雷坝镇",
    "id": "L"
  },
  {
    "name": "雷大镇",
    "id": "L"
  },
  {
    "name": "雷王乡",
    "id": "L"
  },
  {
    "name": "黎坪镇",
    "id": "L"
  },
  {
    "name": "礼县",
    "id": "L"
  },
  {
    "name": "礼辛镇",
    "id": "L"
  },
  {
    "name": "李店镇",
    "id": "L"
  },
  {
    "name": "李家堡镇",
    "id": "L"
  },
  {
    "name": "李家店乡",
    "id": "L"
  },
  {
    "name": "李桥乡",
    "id": "L"
  },
  {
    "name": "理川镇",
    "id": "L"
  },
  {
    "name": "立节镇",
    "id": "L"
  },
  {
    "name": "利桥镇",
    "id": "L"
  },
  {
    "name": "荔堡镇",
    "id": "L"
  },
  {
    "name": "栗川镇",
    "id": "L"
  },
  {
    "name": "连城镇",
    "id": "L"
  },
  {
    "name": "连搭镇",
    "id": "L"
  },
  {
    "name": "连儿湾乡",
    "id": "L"
  },
  {
    "name": "连五乡",
    "id": "L"
  },
  {
    "name": "莲峰镇",
    "id": "L"
  },
  {
    "name": "莲花镇",
    "id": "L"
  },
  {
    "name": "莲麓镇",
    "id": "L"
  },
  {
    "name": "良平镇",
    "id": "L"
  },
  {
    "name": "良邑乡",
    "id": "L"
  },
  {
    "name": "凉州区",
    "id": "L"
  },
  {
    "name": "梁湖乡",
    "id": "L"
  },
  {
    "name": "梁家墩镇",
    "id": "L"
  },
  {
    "name": "梁家寺乡",
    "id": "L"
  },
  {
    "name": "梁山镇",
    "id": "L"
  },
  {
    "name": "梁原乡",
    "id": "L"
  },
  {
    "name": "两当县",
    "id": "L"
  },
  {
    "name": "两河口镇",
    "id": "L"
  },
  {
    "name": "两河镇",
    "id": "L"
  },
  {
    "name": "两水镇",
    "id": "L"
  },
  {
    "name": "蓼泉镇",
    "id": "L"
  },
  {
    "name": "林镇乡",
    "id": "L"
  },
  {
    "name": "临江铺镇",
    "id": "L"
  },
  {
    "name": "临江镇",
    "id": "L"
  },
  {
    "name": "临泾镇",
    "id": "L"
  },
  {
    "name": "临潭县",
    "id": "L"
  },
  {
    "name": "临洮县",
    "id": "L"
  },
  {
    "name": "临夏回族自治州",
    "id": "L"
  },
  {
    "name": "临夏市",
    "id": "L"
  },
  {
    "name": "临夏县",
    "id": "L"
  },
  {
    "name": "临泽县",
    "id": "L"
  },
  {
    "name": "灵台县",
    "id": "L"
  },
  {
    "name": "灵芝乡",
    "id": "L"
  },
  {
    "name": "刘堡镇",
    "id": "L"
  },
  {
    "name": "刘川镇",
    "id": "L"
  },
  {
    "name": "刘集乡",
    "id": "L"
  },
  {
    "name": "刘家坪乡",
    "id": "L"
  },
  {
    "name": "刘家峡镇",
    "id": "L"
  },
  {
    "name": "刘家寨子镇",
    "id": "L"
  },
  {
    "name": "刘坪镇",
    "id": "L"
  },
  {
    "name": "流川乡",
    "id": "L"
  },
  {
    "name": "流顺乡",
    "id": "L"
  },
  {
    "name": "柳沟乡",
    "id": "L"
  },
  {
    "name": "柳河镇",
    "id": "L"
  },
  {
    "name": "柳湖乡",
    "id": "L"
  },
  {
    "name": "柳湖镇",
    "id": "L"
  },
  {
    "name": "柳梁乡",
    "id": "L"
  },
  {
    "name": "柳林镇",
    "id": "L"
  },
  {
    "name": "柳泉镇",
    "id": "L"
  },
  {
    "name": "柳树乡",
    "id": "L"
  },
  {
    "name": "柳树镇",
    "id": "L"
  },
  {
    "name": "柳园镇",
    "id": "L"
  },
  {
    "name": "六坝镇",
    "id": "L"
  },
  {
    "name": "六墩乡",
    "id": "L"
  },
  {
    "name": "六峰镇",
    "id": "L"
  },
  {
    "name": "六巷乡",
    "id": "L"
  },
  {
    "name": "龙坝乡",
    "id": "L"
  },
  {
    "name": "龙凤乡",
    "id": "L"
  },
  {
    "name": "龙林镇",
    "id": "L"
  },
  {
    "name": "龙门乡",
    "id": "L"
  },
  {
    "name": "龙门镇",
    "id": "L"
  },
  {
    "name": "龙渠乡",
    "id": "L"
  },
  {
    "name": "龙泉寺镇",
    "id": "L"
  },
  {
    "name": "龙泉乡",
    "id": "L"
  },
  {
    "name": "龙泉镇",
    "id": "L"
  },
  {
    "name": "龙山镇",
    "id": "L"
  },
  {
    "name": "龙台镇",
    "id": "L"
  },
  {
    "name": "隆兴乡",
    "id": "L"
  },
  {
    "name": "陇城镇",
    "id": "L"
  },
  {
    "name": "陇川镇",
    "id": "L"
  },
  {
    "name": "陇东镇",
    "id": "L"
  },
  {
    "name": "陇南市",
    "id": "L"
  },
  {
    "name": "陇山镇",
    "id": "L"
  },
  {
    "name": "陇西县",
    "id": "L"
  },
  {
    "name": "陇阳镇",
    "id": "L"
  },
  {
    "name": "卢河乡",
    "id": "L"
  },
  {
    "name": "芦家湾乡",
    "id": "L"
  },
  {
    "name": "芦阳镇",
    "id": "L"
  },
  {
    "name": "鲁家沟镇",
    "id": "L"
  },
  {
    "name": "碌曲县",
    "id": "L"
  },
  {
    "name": "路盘乡",
    "id": "L"
  },
  {
    "name": "路园镇",
    "id": "L"
  },
  {
    "name": "罗坝镇",
    "id": "L"
  },
  {
    "name": "罗城镇",
    "id": "L"
  },
  {
    "name": "罗汉洞乡",
    "id": "L"
  },
  {
    "name": "罗家集镇",
    "id": "L"
  },
  {
    "name": "罗山川乡",
    "id": "L"
  },
  {
    "name": "洛大镇",
    "id": "L"
  },
  {
    "name": "洛门镇",
    "id": "L"
  },
  {
    "name": "洛塘镇",
    "id": "L"
  },
  {
    "name": "洛峪镇",
    "id": "L"
  },
  {
    "name": "骆驼城镇",
    "id": "L"
  }
    ]
  }, {

    title: "M",
    item: [
      {
		"name": "麻当镇",
		"id": "M"
	  },
	  {
		"name": "麻家集镇",
		"id": "M"
	  },
	  {
		"name": "麻尼寺沟乡",
		"id": "M"
	  },
	  {
		"name": "麻武乡",
		"id": "M"
	  },
	  {
		"name": "麻沿河镇",
		"id": "M"
	  },
	  {
		"name": "麻子川镇",
		"id": "M"
	  },
	  {
		"name": "马关镇",
		"id": "M"
	  },
	  {
		"name": "马河乡",
		"id": "M"
	  },
	  {
		"name": "马河镇",
		"id": "M"
	  },
	  {
		"name": "马集镇",
		"id": "M"
	  },
	  {
		"name": "马家堡镇",
		"id": "M"
	  },
	  {
		"name": "马街镇",
		"id": "M"
	  },
	  {
		"name": "马力镇",
		"id": "M"
	  },
	  {
		"name": "马岭镇",
		"id": "M"
	  },
	  {
		"name": "马鹿镇",
		"id": "M"
	  },
	  {
		"name": "马跑泉镇",
		"id": "M"
	  },
	  {
		"name": "马坡乡",
		"id": "M"
	  },
	  {
		"name": "马渠乡",
		"id": "M"
	  },
	  {
		"name": "马泉乡",
		"id": "M"
	  },
	  {
		"name": "马蹄藏族乡",
		"id": "M"
	  },
	  {
		"name": "马坞镇",
		"id": "M"
	  },
	  {
		"name": "马峡镇",
		"id": "M"
	  },
	  {
		"name": "马营镇",
		"id": "M"
	  },
	  {
		"name": "马元镇",
		"id": "M"
	  },
	  {
		"name": "马鬃山镇",
		"id": "M"
	  },
	  {
		"name": "玛艾镇",
		"id": "M"
	  },
	  {
		"name": "玛曲县",
		"id": "M"
	  },
	  {
		"name": "买家集镇",
		"id": "M"
	  },
	  {
		"name": "买家巷镇",
		"id": "M"
	  },
	  {
		"name": "麦积区",
		"id": "M"
	  },
	  {
		"name": "麦积镇",
		"id": "M"
	  },
	  {
		"name": "曼日玛镇",
		"id": "M"
	  },
	  {
		"name": "漫路乡",
		"id": "M"
	  },
	  {
		"name": "漫水滩乡",
		"id": "M"
	  },
	  {
		"name": "漫洼乡",
		"id": "M"
	  },
	  {
		"name": "毛藏乡",
		"id": "M"
	  },
	  {
		"name": "毛井镇",
		"id": "M"
	  },
	  {
		"name": "梅川镇",
		"id": "M"
	  },
	  {
		"name": "孟坝镇",
		"id": "M"
	  },
	  {
		"name": "迷坝乡",
		"id": "M"
	  },
	  {
		"name": "糜滩镇",
		"id": "M"
	  },
	  {
		"name": "米桥镇",
		"id": "M"
	  },
	  {
		"name": "庙渠乡",
		"id": "M"
	  },
	  {
		"name": "民乐县",
		"id": "M"
	  },
	  {
		"name": "民乐乡",
		"id": "M"
	  },
	  {
		"name": "民联镇",
		"id": "M"
	  },
	  {
		"name": "民勤县",
		"id": "M"
	  },
	  {
		"name": "民权镇",
		"id": "M"
	  },
	  {
		"name": "民主乡",
		"id": "M"
	  },
	  {
		"name": "岷县",
		"id": "M"
	  },
	  {
		"name": "岷阳镇",
		"id": "M"
	  },
	  {
		"name": "明花乡",
		"id": "M"
	  },
	  {
		"name": "明永镇",
		"id": "M"
	  },
	  {
		"name": "鸣鹿乡",
		"id": "M"
	  },
	  {
		"name": "磨坝藏族乡",
		"id": "M"
	  },
	  {
		"name": "莫高镇",
		"id": "M"
	  },
	  {
		"name": "漠泥沟乡",
		"id": "M"
	  },
	  {
		"name": "牡丹镇",
		"id": "M"
	  },
	  {
		"name": "木钵镇",
		"id": "M"
	  },
	  {
		"name": "木耳乡",
		"id": "M"
	  },
	  {
		"name": "木耳镇",
		"id": "M"
	  },
	  {
		"name": "木河乡",
		"id": "M"
	  },
	  {
		"name": "木林乡",
		"id": "M"
	  },
	  {
		"name": "木西合乡",
		"id": "M"
	  }
    ]
  }, {
    title: "N",
    item: [
	  {
		"name": "那勒寺镇",
		"id": "N"
	  },
	  {
		"name": "那吾镇",
		"id": "N"
	  },
	  {
		"name": "纳浪乡",
		"id": "N"
	  },
	  {
		"name": "南坝乡",
		"id": "N"
	  },
	  {
		"name": "南岔镇",
		"id": "N"
	  },
	  {
		"name": "南川乡",
		"id": "N"
	  },
	  {
		"name": "南丰镇",
		"id": "N"
	  },
	  {
		"name": "南古镇",
		"id": "N"
	  },
	  {
		"name": "南河镇",
		"id": "N"
	  },
	  {
		"name": "南湖镇",
		"id": "N"
	  },
	  {
		"name": "南华镇",
		"id": "N"
	  },
	  {
		"name": "南街办事处",
		"id": "N"
	  },
	  {
		"name": "南梁镇",
		"id": "N"
	  },
	  {
		"name": "南龙镇",
		"id": "N"
	  },
	  {
		"name": "南坪乡",
		"id": "N"
	  },
	  {
		"name": "南屏镇",
		"id": "N"
	  },
	  {
		"name": "南湫乡",
		"id": "N"
	  },
	  {
		"name": "南阳镇",
		"id": "N"
	  },
	  {
		"name": "南义乡",
		"id": "N"
	  },
	  {
		"name": "南峪乡",
		"id": "N"
	  },
	  {
		"name": "南塬乡",
		"id": "N"
	  },
	  {
		"name": "南庄乡",
		"id": "N"
	  },
	  {
		"name": "内官营镇",
		"id": "N"
	  },
	  {
		"name": "尼傲乡",
		"id": "N"
	  },
	  {
		"name": "尼巴乡",
		"id": "N"
	  },
	  {
		"name": "尼玛镇",
		"id": "N"
	  },
	  {
		"name": "泥阳镇",
		"id": "N"
	  },
	  {
		"name": "倪家营镇",
		"id": "N"
	  },
	  {
		"name": "碾坝镇",
		"id": "N"
	  },
	  {
		"name": "娘娘坝镇",
		"id": "N"
	  },
	  {
		"name": "宁县",
		"id": "N"
	  },
	  {
		"name": "宁远堡镇",
		"id": "N"
	  },
	  {
		"name": "宁远镇",
		"id": "N"
	  }
    ]
  }, {
    title: "P",
    item: [
	  {
		"name": "盘安镇",
		"id": "P"
	  },
	  {
		"name": "盘克镇",
		"id": "P"
	  },
	  {
		"name": "磐安镇",
		"id": "P"
	  },
	  {
		"name": "庞家乡",
		"id": "P"
	  },
	  {
		"name": "抛沙镇",
		"id": "P"
	  },
	  {
		"name": "裴家营镇",
		"id": "P"
	  },
	  {
		"name": "彭家坪镇",
		"id": "P"
	  },
	  {
		"name": "彭原镇",
		"id": "P"
	  },
	  {
		"name": "琵琶镇",
		"id": "P"
	  },
	  {
		"name": "平安乡",
		"id": "P"
	  },
	  {
		"name": "平安镇",
		"id": "P"
	  },
	  {
		"name": "平堡镇",
		"id": "P"
	  },
	  {
		"name": "平川区",
		"id": "P"
	  },
	  {
		"name": "平川镇",
		"id": "P"
	  },
	  {
		"name": "平凉市",
		"id": "P"
	  },
	  {
		"name": "平洛镇",
		"id": "P"
	  },
	  {
		"name": "平南镇",
		"id": "P"
	  },
	  {
		"name": "平泉镇",
		"id": "P"
	  },
	  {
		"name": "平山湖蒙古族乡",
		"id": "P"
	  },
	  {
		"name": "平头川镇",
		"id": "P"
	  },
	  {
		"name": "平襄镇",
		"id": "P"
	  },
	  {
		"name": "平子镇",
		"id": "P"
	  },
	  {
		"name": "坪城乡",
		"id": "P"
	  },
	  {
		"name": "坪定乡",
		"id": "P"
	  },
	  {
		"name": "坪沟乡",
		"id": "P"
	  },
	  {
		"name": "坪垭藏族乡",
		"id": "P"
	  },
	  {
		"name": "坪庄乡",
		"id": "P"
	  },
	  {
		"name": "坡头乡",
		"id": "P"
	  },
	  {
		"name": "铺川乡",
		"id": "P"
	  },
	  {
		"name": "蒲池乡",
		"id": "P"
	  },
	  {
		"name": "蒲麻镇",
		"id": "P"
	  },
	  {
		"name": "蒲窝镇",
		"id": "P"
	  }
    ]
  }, {
    title: "Q",
    item:[
	  {
		"name": "七墩回族东乡族乡",
		"id": "Q"
	  },
	  {
		"name": "七里河区",
		"id": "Q"
	  },
	  {
		"name": "七里镇",
		"id": "Q"
	  },
	  {
		"name": "七山乡",
		"id": "Q"
	  },
	  {
		"name": "齐哈玛镇",
		"id": "Q"
	  },
	  {
		"name": "齐家镇",
		"id": "Q"
	  },
	  {
		"name": "齐寿镇",
		"id": "Q"
	  },
	  {
		"name": "祁丰蔵族乡",
		"id": "Q"
	  },
	  {
		"name": "祁家集镇",
		"id": "Q"
	  },
	  {
		"name": "祁家庙镇",
		"id": "Q"
	  },
	  {
		"name": "祁连乡",
		"id": "Q"
	  },
	  {
		"name": "祁山镇",
		"id": "Q"
	  },
	  {
		"name": "恰盖乡",
		"id": "Q"
	  },
	  {
		"name": "千户镇",
		"id": "Q"
	  },
	  {
		"name": "强湾乡",
		"id": "Q"
	  },
	  {
		"name": "锹峪镇",
		"id": "Q"
	  },
	  {
		"name": "乔川乡",
		"id": "Q"
	  },
	  {
		"name": "乔河乡",
		"id": "Q"
	  },
	  {
		"name": "桥寺乡",
		"id": "Q"
	  },
	  {
		"name": "桥头乡",
		"id": "Q"
	  },
	  {
		"name": "桥头镇",
		"id": "Q"
	  },
	  {
		"name": "癿藏镇",
		"id": "Q"
	  },
	  {
		"name": "秦安县",
		"id": "Q"
	  },
	  {
		"name": "秦川镇",
		"id": "Q"
	  },
	  {
		"name": "秦岭镇",
		"id": "Q"
	  },
	  {
		"name": "秦祁乡",
		"id": "Q"
	  },
	  {
		"name": "秦亭镇",
		"id": "Q"
	  },
	  {
		"name": "秦团庄乡",
		"id": "Q"
	  },
	  {
		"name": "秦许乡",
		"id": "Q"
	  },
	  {
		"name": "秦州区",
		"id": "Q"
	  },
	  {
		"name": "青城镇",
		"id": "Q"
	  },
	  {
		"name": "青海石油管理局生活基地",
		"id": "Q"
	  },
	  {
		"name": "青岚山乡",
		"id": "Q"
	  },
	  {
		"name": "清泉镇",
		"id": "Q"
	  },
	  {
		"name": "清水县",
		"id": "Q"
	  },
	  {
		"name": "清水县科技养殖示范园区",
		"id": "Q"
	  },
	  {
		"name": "清水驿乡",
		"id": "Q"
	  },
	  {
		"name": "清水镇",
		"id": "Q"
	  },
	  {
		"name": "清源镇",
		"id": "Q"
	  },
	  {
		"name": "庆城县",
		"id": "Q"
	  },
	  {
		"name": "庆城镇",
		"id": "Q"
	  },
	  {
		"name": "庆坪镇",
		"id": "Q"
	  },
	  {
		"name": "庆阳市",
		"id": "Q"
	  },
	  {
		"name": "湫山乡",
		"id": "Q"
	  },
	  {
		"name": "湫头镇",
		"id": "Q"
	  },
	  {
		"name": "曲奥乡",
		"id": "Q"
	  },
	  {
		"name": "曲告纳镇",
		"id": "Q"
	  },
	  {
		"name": "曲瓦乡",
		"id": "Q"
	  },
	  {
		"name": "曲子镇",
		"id": "Q"
	  },
	  {
		"name": "权家湾镇",
		"id": "Q"
	  },
	  {
		"name": "泉湖镇",
		"id": "Q"
	  },
	  {
		"name": "泉山镇",
		"id": "Q"
	  }

    ]
  }, {

    title: "R",
    item: [
     {
		"name": "仁大镇",
		"id": "r"
	  },
	  {
		"name": "柔远镇",
		"id": "r"
	  },
	  {
		"name": "汭丰镇",
		"id": "r"
	  },
	  {
		"name": "若笠乡",
		"id": "r"
	  }
    ]
  }, {

    title: "S",
    item:[
      {
		"name": "赛拉隆乡",
		"id": "S"
	  },
	  {
		"name": "赛什斯镇",
		"id": "S"
	  },
	  {
		"name": "三堡镇",
		"id": "S"
	  },
	  {
		"name": "三仓乡",
		"id": "S"
	  },
	  {
		"name": "三岔乡",
		"id": "S"
	  },
	  {
		"name": "三岔镇",
		"id": "S"
	  },
	  {
		"name": "三道沟镇",
		"id": "S"
	  },
	  {
		"name": "三墩镇",
		"id": "S"
	  },
	  {
		"name": "三合乡",
		"id": "S"
	  },
	  {
		"name": "三合镇",
		"id": "S"
	  },
	  {
		"name": "三河坝乡",
		"id": "S"
	  },
	  {
		"name": "三河镇",
		"id": "S"
	  },
	  {
		"name": "三嘉乡",
		"id": "S"
	  },
	  {
		"name": "三甲集镇",
		"id": "S"
	  },
	  {
		"name": "三角城乡",
		"id": "S"
	  },
	  {
		"name": "三雷镇",
		"id": "S"
	  },
	  {
		"name": "三十里铺镇",
		"id": "S"
	  },
	  {
		"name": "三滩镇",
		"id": "S"
	  },
	  {
		"name": "三条岘乡",
		"id": "S"
	  },
	  {
		"name": "三峪乡",
		"id": "S"
	  },
	  {
		"name": "三塬镇",
		"id": "S"
	  },
	  {
		"name": "三闸镇",
		"id": "S"
	  },
	  {
		"name": "桑坝乡",
		"id": "S"
	  },
	  {
		"name": "桑科镇",
		"id": "S"
	  },
	  {
		"name": "沙坝镇",
		"id": "S"
	  },
	  {
		"name": "沙河回族乡",
		"id": "S"
	  },
	  {
		"name": "沙河镇",
		"id": "S"
	  },
	  {
		"name": "沙金乡",
		"id": "S"
	  },
	  {
		"name": "沙井镇",
		"id": "S"
	  },
	  {
		"name": "沙湾镇",
		"id": "S"
	  },
	  {
		"name": "沙州镇",
		"id": "S"
	  },
	  {
		"name": "晒经乡",
		"id": "S"
	  },
	  {
		"name": "山城乡",
		"id": "S"
	  },
	  {
		"name": "山丹县",
		"id": "S"
	  },
	  {
		"name": "山丹镇",
		"id": "S"
	  },
	  {
		"name": "山河镇",
		"id": "S"
	  },
	  {
		"name": "山门镇",
		"id": "S"
	  },
	  {
		"name": "山寨乡",
		"id": "S"
	  },
	  {
		"name": "山庄乡",
		"id": "S"
	  },
	  {
		"name": "上坝镇",
		"id": "S"
	  },
	  {
		"name": "上川镇",
		"id": "S"
	  },
	  {
		"name": "上关镇",
		"id": "S"
	  },
	  {
		"name": "上花岔乡",
		"id": "S"
	  },
	  {
		"name": "上里塬乡",
		"id": "S"
	  },
	  {
		"name": "上良镇",
		"id": "S"
	  },
	  {
		"name": "上坪乡",
		"id": "S"
	  },
	  {
		"name": "上秦镇",
		"id": "S"
	  },
	  {
		"name": "上沙沃镇",
		"id": "S"
	  },
	  {
		"name": "上湾乡",
		"id": "S"
	  },
	  {
		"name": "上湾镇",
		"id": "S"
	  },
	  {
		"name": "上肖乡",
		"id": "S"
	  },
	  {
		"name": "上杨乡",
		"id": "S"
	  },
	  {
		"name": "上营乡",
		"id": "S"
	  },
	  {
		"name": "尚德镇",
		"id": "S"
	  },
	  {
		"name": "稍峪乡",
		"id": "S"
	  },
	  {
		"name": "勺哇土族乡",
		"id": "S"
	  },
	  {
		"name": "邵寨镇",
		"id": "S"
	  },
	  {
		"name": "舍书乡",
		"id": "S"
	  },
	  {
		"name": "社棠镇",
		"id": "S"
	  },
	  {
		"name": "申藏乡",
		"id": "S"
	  },
	  {
		"name": "申都乡",
		"id": "S"
	  },
	  {
		"name": "深沟乡",
		"id": "S"
	  },
	  {
		"name": "什川镇",
		"id": "S"
	  },
	  {
		"name": "什社乡",
		"id": "S"
	  },
	  {
		"name": "什字镇",
		"id": "S"
	  },
	  {
		"name": "神峪乡",
		"id": "S"
	  },
	  {
		"name": "狮子乡",
		"id": "S"
	  },
	  {
		"name": "十八里堡乡",
		"id": "S"
	  },
	  {
		"name": "十号基地",
		"id": "S"
	  },
	  {
		"name": "十里镇",
		"id": "S"
	  },
	  {
		"name": "石包城乡",
		"id": "S"
	  },
	  {
		"name": "石堡镇",
		"id": "S"
	  },
	  {
		"name": "石川镇",
		"id": "S"
	  },
	  {
		"name": "石洞镇",
		"id": "S"
	  },
	  {
		"name": "石坊镇",
		"id": "S"
	  },
	  {
		"name": "石佛镇",
		"id": "S"
	  },
	  {
		"name": "石鸡坝镇",
		"id": "S"
	  },
	  {
		"name": "石门乡",
		"id": "S"
	  },
	  {
		"name": "石门镇",
		"id": "S"
	  },
	  {
		"name": "石桥镇",
		"id": "S"
	  },
	  {
		"name": "石泉乡",
		"id": "S"
	  },
	  {
		"name": "石峡湾乡",
		"id": "S"
	  },
	  {
		"name": "石峡镇",
		"id": "S"
	  },
	  {
		"name": "石塬乡",
		"id": "S"
	  },
	  {
		"name": "收成镇",
		"id": "S"
	  },
	  {
		"name": "首阳镇",
		"id": "S"
	  },
	  {
		"name": "树屏镇",
		"id": "S"
	  },
	  {
		"name": "双岔镇",
		"id": "S"
	  },
	  {
		"name": "双城镇",
		"id": "S"
	  },
	  {
		"name": "双茨科镇",
		"id": "S"
	  },
	  {
		"name": "双龙镇",
		"id": "S"
	  },
	  {
		"name": "双泉镇",
		"id": "S"
	  },
	  {
		"name": "双塔镇",
		"id": "S"
	  },
	  {
		"name": "双湾镇",
		"id": "S"
	  },
	  {
		"name": "双岘乡",
		"id": "S"
	  },
	  {
		"name": "水川镇",
		"id": "S"
	  },
	  {
		"name": "水阜镇",
		"id": "S"
	  },
	  {
		"name": "水洛镇",
		"id": "S"
	  },
	  {
		"name": "水泉乡",
		"id": "S"
	  },
	  {
		"name": "水泉镇",
		"id": "S"
	  },
	  {
		"name": "水阳镇",
		"id": "S"
	  },
	  {
		"name": "水源镇",
		"id": "S"
	  },
	  {
		"name": "顺化镇",
		"id": "S"
	  },
	  {
		"name": "司桥乡",
		"id": "S"
	  },
	  {
		"name": "四坝镇",
		"id": "S"
	  },
	  {
		"name": "四房吴镇",
		"id": "S"
	  },
	  {
		"name": "四合原旅游开发办公室",
		"id": "S"
	  },
	  {
		"name": "四河镇",
		"id": "S"
	  },
	  {
		"name": "四龙镇",
		"id": "S"
	  },
	  {
		"name": "四门镇",
		"id": "S"
	  },
	  {
		"name": "四十里铺镇",
		"id": "S"
	  },
	  {
		"name": "四族镇",
		"id": "S"
	  },
	  {
		"name": "寺沟镇",
		"id": "S"
	  },
	  {
		"name": "寺台乡",
		"id": "S"
	  },
	  {
		"name": "寺滩乡",
		"id": "S"
	  },
	  {
		"name": "寺子川乡",
		"id": "S"
	  },
	  {
		"name": "泗水镇",
		"id": "S"
	  },
	  {
		"name": "松鸣镇",
		"id": "S"
	  },
	  {
		"name": "松山镇",
		"id": "S"
	  },
	  {
		"name": "松树镇",
		"id": "S"
	  },
	  {
		"name": "宋坪乡",
		"id": "S"
	  },
	  {
		"name": "苏合乡",
		"id": "S"
	  },
	  {
		"name": "苏集镇",
		"id": "S"
	  },
	  {
		"name": "苏武镇",
		"id": "S"
	  },
	  {
		"name": "苏元镇",
		"id": "S"
	  },
	  {
		"name": "肃北蒙古族自治县",
		"id": "S"
	  },
	  {
		"name": "肃南裕固族自治县",
		"id": "S"
	  },
	  {
		"name": "肃州区",
		"id": "S"
	  },
	  {
		"name": "肃州镇",
		"id": "S"
	  },
	  {
		"name": "索池镇",
		"id": "S"
	  },
	  {
		"name": "索罗乡",
		"id": "S"
	  },
	  {
		"name": "锁龙乡",
		"id": "S"
	  },
	  {
		"name": "锁南镇",
		"id": "S"
	  },
	  {
		"name": "锁阳城镇",
		"id": "S"
	  }
    ]
  }, {
    title: "T",
    item: [
	  {
		"name": "太白梁乡",
		"id": "T"
	  },
	  {
		"name": "太白镇",
		"id": "T"
	  },
	  {
		"name": "太昌镇",
		"id": "T"
	  },
	  {
		"name": "太莪乡",
		"id": "T"
	  },
	  {
		"name": "太极镇",
		"id": "T"
	  },
	  {
		"name": "太京镇",
		"id": "T"
	  },
	  {
		"name": "太平店镇",
		"id": "T"
	  },
	  {
		"name": "太平镇",
		"id": "T"
	  },
	  {
		"name": "太石河乡",
		"id": "T"
	  },
	  {
		"name": "太石乡",
		"id": "T"
	  },
	  {
		"name": "太石镇",
		"id": "T"
	  },
	  {
		"name": "泰山乡",
		"id": "T"
	  },
	  {
		"name": "滩歌镇",
		"id": "T"
	  },
	  {
		"name": "滩坪乡",
		"id": "T"
	  },
	  {
		"name": "镡河乡",
		"id": "T"
	  },
	  {
		"name": "炭山岭镇",
		"id": "T"
	  },
	  {
		"name": "唐尕昂乡",
		"id": "T"
	  },
	  {
		"name": "唐汪镇",
		"id": "T"
	  },
	  {
		"name": "洮滨镇",
		"id": "T"
	  },
	  {
		"name": "洮坪镇",
		"id": "T"
	  },
	  {
		"name": "洮砚乡",
		"id": "T"
	  },
	  {
		"name": "洮阳镇",
		"id": "T"
	  },
	  {
		"name": "天池乡",
		"id": "T"
	  },
	  {
		"name": "天池镇",
		"id": "T"
	  },
	  {
		"name": "天水经济开发区",
		"id": "T"
	  },
	  {
		"name": "天水市",
		"id": "T"
	  },
	  {
		"name": "天水镇",
		"id": "T"
	  },
	  {
		"name": "天堂镇",
		"id": "T"
	  },
	  {
		"name": "天祝藏族自治县",
		"id": "T"
	  },
	  {
		"name": "天祝建材厂",
		"id": "T"
	  },
	  {
		"name": "天祝煤电公司",
		"id": "T"
	  },
	  {
		"name": "田家河乡",
		"id": "T"
	  },
	  {
		"name": "甜水镇",
		"id": "T"
	  },
	  {
		"name": "条山集团",
		"id": "T"
	  },
	  {
		"name": "铁楼藏族乡",
		"id": "T"
	  },
	  {
		"name": "通安驿镇",
		"id": "T"
	  },
	  {
		"name": "通化镇",
		"id": "T"
	  },
	  {
		"name": "通渭县",
		"id": "T"
	  },
	  {
		"name": "通远乡",
		"id": "T"
	  },
	  {
		"name": "桐川镇",
		"id": "T"
	  },
	  {
		"name": "铜钱乡",
		"id": "T"
	  },
	  {
		"name": "头寨子镇",
		"id": "T"
	  },
	  {
		"name": "土高山乡",
		"id": "T"
	  },
	  {
		"name": "土门岘镇",
		"id": "T"
	  },
	  {
		"name": "土门镇",
		"id": "T"
	  },
	  {
		"name": "土桥乡",
		"id": "T"
	  },
	  {
		"name": "土桥镇",
		"id": "T"
	  },
	  {
		"name": "团结镇",
		"id": "T"
	  },
	  {
		"name": "屯字镇",
		"id": "T"
	  }
    ]
  }, {
    title: "W",
    item: [
	  {
		"name": "瓦斜乡",
		"id": "W"
	  },
	  {
		"name": "外纳镇",
		"id": "W"
	  },
	  {
		"name": "完冒乡",
		"id": "W"
	  },
	  {
		"name": "万泉镇",
		"id": "W"
	  },
	  {
		"name": "汪川镇",
		"id": "W"
	  },
	  {
		"name": "汪集镇",
		"id": "W"
	  },
	  {
		"name": "王坝乡",
		"id": "W"
	  },
	  {
		"name": "王坝镇",
		"id": "W"
	  },
	  {
		"name": "王村镇",
		"id": "W"
	  },
	  {
		"name": "王格尔塘镇",
		"id": "W"
	  },
	  {
		"name": "王河镇",
		"id": "W"
	  },
	  {
		"name": "王家山镇",
		"id": "W"
	  },
	  {
		"name": "王咀子乡",
		"id": "W"
	  },
	  {
		"name": "王磨镇",
		"id": "W"
	  },
	  {
		"name": "王铺镇",
		"id": "W"
	  },
	  {
		"name": "王旗镇",
		"id": "W"
	  },
	  {
		"name": "王台镇",
		"id": "W"
	  },
	  {
		"name": "王岘镇",
		"id": "W"
	  },
	  {
		"name": "王窑镇",
		"id": "W"
	  },
	  {
		"name": "王尹镇",
		"id": "W"
	  },
	  {
		"name": "旺藏镇",
		"id": "W"
	  },
	  {
		"name": "望关镇",
		"id": "W"
	  },
	  {
		"name": "威戎镇",
		"id": "W"
	  },
	  {
		"name": "韦营乡",
		"id": "W"
	  },
	  {
		"name": "维新镇",
		"id": "W"
	  },
	  {
		"name": "位奇镇",
		"id": "W"
	  },
	  {
		"name": "渭南镇",
		"id": "W"
	  },
	  {
		"name": "渭阳乡",
		"id": "W"
	  },
	  {
		"name": "渭源县",
		"id": "W"
	  },
	  {
		"name": "魏店镇",
		"id": "W"
	  },
	  {
		"name": "魏岭乡",
		"id": "W"
	  },
	  {
		"name": "温泉经济开发区",
		"id": "W"
	  },
	  {
		"name": "温泉镇",
		"id": "W"
	  },
	  {
		"name": "文峰镇",
		"id": "W"
	  },
	  {
		"name": "文殊镇",
		"id": "W"
	  },
	  {
		"name": "文县",
		"id": "W"
	  },
	  {
		"name": "卧龙镇",
		"id": "W"
	  },
	  {
		"name": "乌江镇",
		"id": "W"
	  },
	  {
		"name": "乌兰镇",
		"id": "W"
	  },
	  {
		"name": "吴家井镇",
		"id": "W"
	  },
	  {
		"name": "五佛乡",
		"id": "W"
	  },
	  {
		"name": "五合镇",
		"id": "W"
	  },
	  {
		"name": "五和镇",
		"id": "W"
	  },
	  {
		"name": "五户乡",
		"id": "W"
	  },
	  {
		"name": "五家乡",
		"id": "W"
	  },
	  {
		"name": "五蛟镇",
		"id": "W"
	  },
	  {
		"name": "五库乡",
		"id": "W"
	  },
	  {
		"name": "五龙镇",
		"id": "W"
	  },
	  {
		"name": "五马镇",
		"id": "W"
	  },
	  {
		"name": "五顷原乡",
		"id": "W"
	  },
	  {
		"name": "五营镇",
		"id": "W"
	  },
	  {
		"name": "五竹镇",
		"id": "W"
	  },
	  {
		"name": "武川乡",
		"id": "W"
	  },
	  {
		"name": "武当乡",
		"id": "W"
	  },
	  {
		"name": "武都区",
		"id": "W"
	  },
	  {
		"name": "武沟乡",
		"id": "W"
	  },
	  {
		"name": "武家河镇",
		"id": "W"
	  },
	  {
		"name": "武南镇",
		"id": "W"
	  },
	  {
		"name": "武坪乡",
		"id": "W"
	  },
	  {
		"name": "武山县",
		"id": "W"
	  },
	  {
		"name": "武胜驿镇",
		"id": "W"
	  },
	  {
		"name": "武威市",
		"id": "W"
	  },
	  {
		"name": "武阳镇",
		"id": "W"
	  }
    ]
  }, {
    title: "X",
    item: [

      {
		"name": "西坝乡",
		"id": "X"
	  },
	  {
		"name": "西仓镇",
		"id": "X"
	  },
	  {
		"name": "西岔镇",
		"id": "X"
	  },
	  {
		"name": "西川镇",
		"id": "X"
	  },
	  {
		"name": "西大滩镇",
		"id": "X"
	  },
	  {
		"name": "西洞镇",
		"id": "X"
	  },
	  {
		"name": "西峰区",
		"id": "X"
	  },
	  {
		"name": "西峰镇",
		"id": "X"
	  },
	  {
		"name": "西高山乡",
		"id": "X"
	  },
	  {
		"name": "西巩驿镇",
		"id": "X"
	  },
	  {
		"name": "西固区",
		"id": "X"
	  },
	  {
		"name": "西果园镇",
		"id": "X"
	  },
	  {
		"name": "西和县",
		"id": "X"
	  },
	  {
		"name": "西河镇",
		"id": "X"
	  },
	  {
		"name": "西湖镇",
		"id": "X"
	  },
	  {
		"name": "西华池镇",
		"id": "X"
	  },
	  {
		"name": "西华镇",
		"id": "X"
	  },
	  {
		"name": "西江镇",
		"id": "X"
	  },
	  {
		"name": "西街办事处",
		"id": "X"
	  },
	  {
		"name": "西靖镇",
		"id": "X"
	  },
	  {
		"name": "西坪镇",
		"id": "X"
	  },
	  {
		"name": "西坡镇",
		"id": "X"
	  },
	  {
		"name": "西渠镇",
		"id": "X"
	  },
	  {
		"name": "西屯镇",
		"id": "X"
	  },
	  {
		"name": "西阳乡",
		"id": "X"
	  },
	  {
		"name": "西营镇",
		"id": "X"
	  },
	  {
		"name": "西峪镇",
		"id": "X"
	  },
	  {
		"name": "西寨镇",
		"id": "X"
	  },
	  {
		"name": "喜泉镇",
		"id": "X"
	  },
	  {
		"name": "细巷镇",
		"id": "X"
	  },
	  {
		"name": "峡城乡",
		"id": "X"
	  },
	  {
		"name": "峡口镇",
		"id": "X"
	  },
	  {
		"name": "峡门乡",
		"id": "X"
	  },
	  {
		"name": "下河清镇",
		"id": "X"
	  },
	  {
		"name": "下双镇",
		"id": "X"
	  },
	  {
		"name": "下西号镇",
		"id": "X"
	  },
	  {
		"name": "夏官营镇",
		"id": "X"
	  },
	  {
		"name": "夏河县",
		"id": "X"
	  },
	  {
		"name": "先锋乡",
		"id": "X"
	  },
	  {
		"name": "显龙镇",
		"id": "X"
	  },
	  {
		"name": "显胜乡",
		"id": "X"
	  },
	  {
		"name": "岘塬镇",
		"id": "X"
	  },
	  {
		"name": "香莲乡",
		"id": "X"
	  },
	  {
		"name": "香泉镇",
		"id": "X"
	  },
	  {
		"name": "湘乐镇",
		"id": "X"
	  },
	  {
		"name": "襄南镇",
		"id": "X"
	  },
	  {
		"name": "巷道镇",
		"id": "X"
	  },
	  {
		"name": "肖金镇",
		"id": "X"
	  },
	  {
		"name": "肖咀乡",
		"id": "X"
	  },
	  {
		"name": "肖良乡",
		"id": "X"
	  },
	  {
		"name": "小川镇",
		"id": "X"
	  },
	  {
		"name": "小关乡",
		"id": "X"
	  },
	  {
		"name": "小金湾东乡族乡",
		"id": "X"
	  },
	  {
		"name": "小康营乡",
		"id": "X"
	  },
	  {
		"name": "小岭乡",
		"id": "X"
	  },
	  {
		"name": "小满镇",
		"id": "X"
	  },
	  {
		"name": "小南沟乡",
		"id": "X"
	  },
	  {
		"name": "谢河镇",
		"id": "X"
	  },
	  {
		"name": "谢家湾乡",
		"id": "X"
	  },
	  {
		"name": "辛店镇",
		"id": "X"
	  },
	  {
		"name": "新坝镇",
		"id": "X"
	  },
	  {
		"name": "新堡乡",
		"id": "X"
	  },
	  {
		"name": "新城乡",
		"id": "X"
	  },
	  {
		"name": "新城镇",
		"id": "X"
	  },
	  {
		"name": "新城子藏族乡",
		"id": "X"
	  },
	  {
		"name": "新城子镇",
		"id": "X"
	  },
	  {
		"name": "新店乡",
		"id": "X"
	  },
	  {
		"name": "新墩镇",
		"id": "X"
	  },
	  {
		"name": "新华乡",
		"id": "X"
	  },
	  {
		"name": "新华镇",
		"id": "X"
	  },
	  {
		"name": "新集乡",
		"id": "X"
	  },
	  {
		"name": "新集镇",
		"id": "X"
	  },
	  {
		"name": "新景乡",
		"id": "X"
	  },
	  {
		"name": "新开乡",
		"id": "X"
	  },
	  {
		"name": "新宁镇",
		"id": "X"
	  },
	  {
		"name": "新寺乡",
		"id": "X"
	  },
	  {
		"name": "新寺镇",
		"id": "X"
	  },
	  {
		"name": "新天镇",
		"id": "X"
	  },
	  {
		"name": "新添堡回族乡",
		"id": "X"
	  },
	  {
		"name": "新添镇",
		"id": "X"
	  },
	  {
		"name": "新兴镇",
		"id": "X"
	  },
	  {
		"name": "新阳镇",
		"id": "X"
	  },
	  {
		"name": "新窑镇",
		"id": "X"
	  },
	  {
		"name": "新营镇",
		"id": "X"
	  },
	  {
		"name": "新塬镇",
		"id": "X"
	  },
	  {
		"name": "新寨乡",
		"id": "X"
	  },
	  {
		"name": "新寨镇",
		"id": "X"
	  },
	  {
		"name": "新庄乡",
		"id": "X"
	  },
	  {
		"name": "新庄镇",
		"id": "X"
	  },
	  {
		"name": "星火乡",
		"id": "X"
	  },
	  {
		"name": "兴丰镇",
		"id": "X"
	  },
	  {
		"name": "兴国镇",
		"id": "X"
	  },
	  {
		"name": "兴化乡",
		"id": "X"
	  },
	  {
		"name": "兴隆乡",
		"id": "X"
	  },
	  {
		"name": "兴隆镇",
		"id": "X"
	  },
	  {
		"name": "杏园乡",
		"id": "X"
	  },
	  {
		"name": "雄关区",
		"id": "X"
	  },
	  {
		"name": "徐顶乡",
		"id": "X"
	  },
	  {
		"name": "徐扈家乡",
		"id": "X"
	  },
	  {
		"name": "宣化镇",
		"id": "X"
	  },
	  {
		"name": "玄马镇",
		"id": "X"
	  },
	  {
		"name": "薛百镇",
		"id": "X"
	  }
    ]
  }, {
    title: "Y",
    item: [
	  {
		"name": "鸭暖镇",
		"id": "Y"
	  },
	  {
		"name": "崖城镇",
		"id": "Y"
	  },
	  {
		"name": "衙下集镇",
		"id": "Y"
	  },
	  {
		"name": "胭脂镇",
		"id": "Y"
	  },
	  {
		"name": "沿安乡",
		"id": "Y"
	  },
	  {
		"name": "沿岭乡",
		"id": "Y"
	  },
	  {
		"name": "盐池湾乡",
		"id": "Y"
	  },
	  {
		"name": "盐官镇",
		"id": "Y"
	  },
	  {
		"name": "盐锅峡镇",
		"id": "Y"
	  },
	  {
		"name": "盐井镇",
		"id": "Y"
	  },
	  {
		"name": "阎家乡",
		"id": "Y"
	  },
	  {
		"name": "演武乡",
		"id": "Y"
	  },
	  {
		"name": "砚峡乡",
		"id": "Y"
	  },
	  {
		"name": "羊井子湾乡",
		"id": "Y"
	  },
	  {
		"name": "羊沙乡",
		"id": "Y"
	  },
	  {
		"name": "羊下坝镇",
		"id": "Y"
	  },
	  {
		"name": "羊永镇",
		"id": "Y"
	  },
	  {
		"name": "阳坝镇",
		"id": "Y"
	  },
	  {
		"name": "阳川镇",
		"id": "Y"
	  },
	  {
		"name": "阳关镇",
		"id": "Y"
	  },
	  {
		"name": "杨店镇",
		"id": "Y"
	  },
	  {
		"name": "杨河乡",
		"id": "Y"
	  },
	  {
		"name": "杨河镇",
		"id": "Y"
	  },
	  {
		"name": "杨家寺镇",
		"id": "Y"
	  },
	  {
		"name": "杨塔乡",
		"id": "Y"
	  },
	  {
		"name": "杨崖集镇",
		"id": "Y"
	  },
	  {
		"name": "姚寨镇",
		"id": "Y"
	  },
	  {
		"name": "窑店镇",
		"id": "Y"
	  },
	  {
		"name": "冶力关镇",
		"id": "Y"
	  },
	  {
		"name": "叶堡镇",
		"id": "Y"
	  },
	  {
		"name": "一条山镇",
		"id": "Y"
	  },
	  {
		"name": "义岗川镇",
		"id": "Y"
	  },
	  {
		"name": "驿马镇",
		"id": "Y"
	  },
	  {
		"name": "益哇镇",
		"id": "Y"
	  },
	  {
		"name": "殪虎桥镇",
		"id": "Y"
	  },
	  {
		"name": "殷家城乡",
		"id": "Y"
	  },
	  {
		"name": "银川乡",
		"id": "Y"
	  },
	  {
		"name": "银达镇",
		"id": "Y"
	  },
	  {
		"name": "银山乡",
		"id": "Y"
	  },
	  {
		"name": "银杏树镇",
		"id": "Y"
	  },
	  {
		"name": "尹集镇",
		"id": "Y"
	  },
	  {
		"name": "营滩乡",
		"id": "Y"
	  },
	  {
		"name": "永昌县",
		"id": "Y"
	  },
	  {
		"name": "永昌镇",
		"id": "Y"
	  },
	  {
		"name": "永登县",
		"id": "Y"
	  },
	  {
		"name": "永丰滩镇",
		"id": "Y"
	  },
	  {
		"name": "永丰镇",
		"id": "Y"
	  },
	  {
		"name": "永固镇",
		"id": "Y"
	  },
	  {
		"name": "永和镇",
		"id": "Y"
	  },
	  {
		"name": "永吉乡",
		"id": "Y"
	  },
	  {
		"name": "永靖县",
		"id": "Y"
	  },
	  {
		"name": "永宁乡",
		"id": "Y"
	  },
	  {
		"name": "永宁镇",
		"id": "Y"
	  },
	  {
		"name": "永坪镇",
		"id": "Y"
	  },
	  {
		"name": "永清镇",
		"id": "Y"
	  },
	  {
		"name": "永新乡",
		"id": "Y"
	  },
	  {
		"name": "永兴镇",
		"id": "Y"
	  },
	  {
		"name": "永正镇",
		"id": "Y"
	  },
	  {
		"name": "余湾乡",
		"id": "Y"
	  },
	  {
		"name": "鱼池乡",
		"id": "Y"
	  },
	  {
		"name": "鱼龙镇",
		"id": "Y"
	  },
	  {
		"name": "榆林乡",
		"id": "Y"
	  },
	  {
		"name": "榆林子镇",
		"id": "Y"
	  },
	  {
		"name": "榆盘镇",
		"id": "Y"
	  },
	  {
		"name": "榆树乡",
		"id": "Y"
	  },
	  {
		"name": "榆中县",
		"id": "Y"
	  },
	  {
		"name": "虞关乡",
		"id": "Y"
	  },
	  {
		"name": "玉都镇",
		"id": "Y"
	  },
	  {
		"name": "玉皇乡",
		"id": "Y"
	  },
	  {
		"name": "玉井镇",
		"id": "Y"
	  },
	  {
		"name": "玉垒乡",
		"id": "Y"
	  },
	  {
		"name": "玉门市",
		"id": "Y"
	  },
	  {
		"name": "玉门镇",
		"id": "Y"
	  },
	  {
		"name": "玉泉镇",
		"id": "Y"
	  },
	  {
		"name": "峪泉镇",
		"id": "Y"
	  },
	  {
		"name": "裕河镇",
		"id": "Y"
	  },
	  {
		"name": "鸳鸯镇",
		"id": "Y"
	  },
	  {
		"name": "渊泉镇",
		"id": "Y"
	  },
	  {
		"name": "元城镇",
		"id": "Y"
	  },
	  {
		"name": "元龙镇",
		"id": "Y"
	  },
	  {
		"name": "园区四十里铺镇",
		"id": "Y"
	  },
	  {
		"name": "园子岔乡",
		"id": "Y"
	  },
	  {
		"name": "原安乡",
		"id": "Y"
	  },
	  {
		"name": "远门镇",
		"id": "Y"
	  },
	  {
		"name": "月牙泉镇",
		"id": "Y"
	  },
	  {
		"name": "月照乡",
		"id": "Y"
	  },
	  {
		"name": "岳堡乡",
		"id": "Y"
	  },
	  {
		"name": "悦乐镇",
		"id": "Y"
	  },
	  {
		"name": "云屏镇",
		"id": "Y"
	  },
	  {
		"name": "云山镇",
		"id": "Y"
	  },
	  {
		"name": "云台镇",
		"id": "Y"
	  },
	  {
		"name": "云田镇",
		"id": "Y"
	  }
    ]
  }, {

    title: "Z",
    item: [
      {
		"name": "早胜镇",
		"id": "Z"
	  },
	  {
		"name": "皂郊镇",
		"id": "Z"
	  },
	  {
		"name": "扎古录镇",
		"id": "Z"
	  },
	  {
		"name": "扎油乡",
		"id": "Z"
	  },
	  {
		"name": "翟家河乡",
		"id": "Z"
	  },
	  {
		"name": "翟家所镇",
		"id": "Z"
	  },
	  {
		"name": "寨河乡",
		"id": "Z"
	  },
	  {
		"name": "寨子沟乡",
		"id": "Z"
	  },
	  {
		"name": "张家川回族自治县",
		"id": "Z"
	  },
	  {
		"name": "张家川镇",
		"id": "Z"
	  },
	  {
		"name": "张家乡",
		"id": "Z"
	  },
	  {
		"name": "张棉乡",
		"id": "Z"
	  },
	  {
		"name": "张掖滨河新区",
		"id": "Z"
	  },
	  {
		"name": "张掖经济技术开发区",
		"id": "Z"
	  },
	  {
		"name": "张掖市",
		"id": "Z"
	  },
	  {
		"name": "张义镇",
		"id": "Z"
	  },
	  {
		"name": "漳县",
		"id": "Z"
	  },
	  {
		"name": "长安镇",
		"id": "Z"
	  },
	  {
		"name": "长坝镇",
		"id": "Z"
	  },
	  {
		"name": "长城区",
		"id": "Z"
	  },
	  {
		"name": "长城镇",
		"id": "Z"
	  },
	  {
		"name": "长川回族乡",
		"id": "Z"
	  },
	  {
		"name": "长道镇",
		"id": "Z"
	  },
	  {
		"name": "长庆桥镇",
		"id": "Z"
	  },
	  {
		"name": "掌子沟乡",
		"id": "Z"
	  },
	  {
		"name": "赵墩乡",
		"id": "Z"
	  },
	  {
		"name": "赵家乡",
		"id": "Z"
	  },
	  {
		"name": "折桥镇",
		"id": "Z"
	  },
	  {
		"name": "镇原县",
		"id": "Z"
	  },
	  {
		"name": "正路镇",
		"id": "Z"
	  },
	  {
		"name": "正宁县",
		"id": "Z"
	  },
	  {
		"name": "郑河乡",
		"id": "Z"
	  },
	  {
		"name": "直滩镇",
		"id": "Z"
	  },
	  {
		"name": "纸坊镇",
		"id": "Z"
	  },
	  {
		"name": "治平乡",
		"id": "Z"
	  },
	  {
		"name": "中坝镇",
		"id": "Z"
	  },
	  {
		"name": "中堡镇",
		"id": "Z"
	  },
	  {
		"name": "中川镇",
		"id": "Z"
	  },
	  {
		"name": "中村镇",
		"id": "Z"
	  },
	  {
		"name": "中东镇",
		"id": "Z"
	  },
	  {
		"name": "中咀岭乡",
		"id": "Z"
	  },
	  {
		"name": "中连川乡",
		"id": "Z"
	  },
	  {
		"name": "中梁镇",
		"id": "Z"
	  },
	  {
		"name": "中庙镇",
		"id": "Z"
	  },
	  {
		"name": "中铺镇",
		"id": "Z"
	  },
	  {
		"name": "中泉镇",
		"id": "Z"
	  },
	  {
		"name": "中山镇",
		"id": "Z"
	  },
	  {
		"name": "中台镇",
		"id": "Z"
	  },
	  {
		"name": "中滩镇",
		"id": "Z"
	  },
	  {
		"name": "中原乡",
		"id": "Z"
	  },
	  {
		"name": "中寨镇",
		"id": "Z"
	  },
	  {
		"name": "忠和镇",
		"id": "Z"
	  },
	  {
		"name": "种田乡",
		"id": "Z"
	  },
	  {
		"name": "重兴镇",
		"id": "Z"
	  },
	  {
		"name": "舟曲县",
		"id": "Z"
	  },
	  {
		"name": "周家坝镇",
		"id": "Z"
	  },
	  {
		"name": "周家镇",
		"id": "Z"
	  },
	  {
		"name": "朱店镇",
		"id": "Z"
	  },
	  {
		"name": "朱王堡镇",
		"id": "Z"
	  },
	  {
		"name": "竹院乡",
		"id": "Z"
	  },
	  {
		"name": "抓喜秀龙乡",
		"id": "Z"
	  },
	  {
		"name": "转渠口镇",
		"id": "Z"
	  },
	  {
		"name": "庄禾集镇",
		"id": "Z"
	  },
	  {
		"name": "庄浪县",
		"id": "Z"
	  },
	  {
		"name": "卓洛回族乡",
		"id": "Z"
	  },
	  {
		"name": "卓尼县",
		"id": "Z"
	  },
	  {
		"name": "紫坊畔乡",
		"id": "Z"
	  },
	  {
		"name": "总寨镇",
		"id": "Z"
	  },
	  {
		"name": "左家乡",
		"id": "Z"
	  },
	  {
		"name": "佐盖多玛乡",
		"id": "Z"
	  },
	  {
		"name": "佐盖曼玛镇",
		"id": "Z"
	  }
    ]
  }
]

module.exports = city;